package cn.manager.common.enums;

/**
 * 小程序异常码
 *
 * @author ljc
 * @version 0.1.0
 * @description ok
 */
public enum ResponseEnum {

    //系统异常码
    //401 (需要认证)
    //403 (无权限)
    A10001(10001, "%s"),
    A10002(10002, "账号或密码错误!"),//系统内部异常(后端运行异常)
    A10003(10003, "账号不存在!"),
    A10004(10004, "此车辆在 %s 秒内不可重复操作[防误操作]"),
    A10005(10005, ""),
    A10006(10006, ""),
    A10007(10007, ""),
    A10008(10008, ""),
    A10009(10009, ""),
    A10010(10010, ""),
    A10011(10011, ""),
    A10012(10012, ""),
    A10013(10013, ""),
    A10014(10014, ""),
    A10015(10015, ""),
    A10016(10016, ""),
    A10017(10017, ""),
    A10018(10018, ""),
    A10019(10019, ""),

    //文件上传专用(备用)
    T160000(160000, "上传文件不能为空"),
    T160001(160001, "上传文件名字不能为空"),
    T160002(160002, "文件名字不允许出现 '%s' 关键字"),
    T160003(160003, "文件不能没有后缀"),
    T160004(160004, "文件格式不支持,请更换后重试"),
    T160005(160005, "文件删除失败:%s"),
    T160006(160006, "上传失败"),
    T160007(160007, "上传文件不得大于 %s MB"),
    T160008(160008, "%s");
    ;

    private final int code;

    private final String message;

    ResponseEnum(int code, String msg) {
        this.code = code;
        this.message = msg;
    }

    public int getCode() {
        return code;
    }

    public String getMessage() {
        return message;
    }
}